#Брой чаши от по 250мл
water <- c(1, 3, 5, 4, 6, 4, 1, 3, 8, 3, 1, 0, 2, 5, 7, 9, 12, 7, 5, 3, 5, 8, 6, 7, 10, 8, 14, 13, 10, 12)
#Средно, колко литра вода пие на ден?
mean(water)*0.25
#Целта, която си е поставил в приложението е да пие поне 1.5 литра вода на ден. Колко от дните е изпълнил целта си?
sum(water>1.5)
#Кой ден от месеца е изпил най-много вода и колко максилмално литра е изпил за 1 ден?
which.max(water)
water[which.max(water)]*0.25
#Кой ден от месеца е изпил най-малко вода?
which.min(water)
#Най-често, колко чаши е пил на ден?
getmode <- function(v) {
  uniqv <- unique(v)
  uniqv[which.max(tabulate(match(v, uniqv)))]
}
modeWater<- getmode(water)
modeWater
#Колко литра вода е изпил общо за месец септември Мишо?
sum(water)*0.25
#Как се е изменяло количеството на изпитата вода от ден на ден на Мишо? В какъв процент от дните тенденцията е била на горе или е оставала без промяна?
diff(water)
diffWater <-c(diff(water))
sum(diffWater>=0)/length(diffWater)*100
#През колко от дните Мишо е постигал точно целта си?
sum(water==6)